YoYoYoCool/SmartPultRepo/SmartPult/DK_TM4C129X.cpp
/*
 *  ======== DK_TM4C129X_initGeneral ========
 */
void DK_TM4C129X_initGeneral(void)
{
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOA);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOB);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOC);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOD);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOE);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOF);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOG);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOH);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOJ);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOK);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOL);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOM);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPION);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOP);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOQ);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOR);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOS);
    SysCtlPeripheralEnable(SYSCTL_PERIPH_GPIOT);
}

#if TI_DRIVERS_EMAC_INCLUDED
#include <ti/drivers/EMAC.h>
#include <ti/drivers/emac/EMACSnow.h>

/*
 *  Required by the Networking Stack (NDK). This array must be NULL terminated.
 *  This can be removed if NDK is not used.
 *  Double curly braces are needed to avoid GCC bug #944572
 *  https://bugs.launchpad.net/gcc-linaro/+bug/944572
 */
NIMU_DEVICE_TABLE_ENTRY  NIMUDeviceTable[2] = {{EMACSnow_NIMUInit}, {NULL}};

/* EMAC objects */
EMACSnow_Object emacObjects[DK_TM4C129X_EMACCOUNT];

/*
 *  EMAC configuration structure
 *  Set user/company specific MAC octates. The following sets the address
 *  to ff-ff-ff-ff-ff-ff. Users need to change this to make the label on
 *  their boards.
 */
unsigned char macAddress[6] = {0xff, 0xff, 0xff, 0xff, 0xff, 0xff};

const EMACSnow_HWAttrs emacHWAttrs[DK_TM4C129X_EMACCOUNT] = {
    {EMAC0_BASE, INT_EMAC0, macAddress}
};

const EMAC_Config EMAC_config[] = {
    {
        &EMACSnow_fxnTable,
        &emacObjects[0],
        &emacHWAttrs[0]
    },
    {NULL, NULL, NULL}
};

/*
 *  ======== DK_TM4C129X_initEMAC ========
 */
void DK_TM4C129X_initEMAC(void)
{
    uint32_t ulUser0, ulUser1;

    /* Get the MAC address */
    FlashUserGet(&ulUser0, &ulUser1);
    if ((ulUser0 != 0xffffffff) && (ulUser1 != 0xffffffff)) {
        System_printf("Using MAC address in flash\n");
        /*
         * Convert the 24/24 split MAC address from NV ram into a 32/16 split MAC
         * address needed to program the hardware registers, then program the MAC
         * address into the Ethernet Controller registers.
         */
        macAddress[0] = ((ulUser0 >>  0) & 0xff);
        macAddress[1] = ((ulUser0 >>  8) & 0xff);
        macAddress[2] = ((ulUser0 >> 16) & 0xff);
        macAddress[3] = ((ulUser1 >>  0) & 0xff);
        macAddress[4] = ((ulUser1 >>  8) & 0xff);
        macAddress[5] = ((ulUser1 >> 16) & 0xff);
    }
    else if (macAddress[0] == 0xff && macAddress[1] == 0xff &&
             macAddress[2] == 0xff && macAddress[3] == 0xff &&
             macAddress[4] == 0xff && macAddress[5] == 0xff) {
        System_abort("Change the macAddress variable to match your boards MAC sticker");
    }

    GPIOPinConfigure(GPIO_PF1_EN0LED2);
    GPIOPinConfigure(GPIO_PK4_EN0LED0);
    GPIOPinConfigure(GPIO_PK6_EN0LED1);
    GPIOPinTypeEthernetLED(GPIO_PORTF_BASE, GPIO_PIN_1);
    GPIOPinTypeEthernetLED(GPIO_PORTK_BASE, GPIO_PIN_4);
    GPIOPinTypeEthernetLED(GPIO_PORTK_BASE, GPIO_PIN_6);

    /* Once EMAC_init is called, EMAC_config cannot be changed */
    EMAC_init();
}
#endif /* TI_DRIVERS_EMAC_INCLUDED */

#include <ti/drivers/GPIO.h>
#include <ti/drivers/GPIO.h>

/* GPIO configuration structure */
#ifdef PULT_DEVELOPING_BOARD

const GPIO_HWAttrs gpioHWAttrs[EK_TM4C1294XL_GPIOCOUNT] = {
			{GPIO_PORTL_BASE, GPIO_PIN_4, GPIO_OUTPUT},
			{GPIO_PORTN_BASE, GPIO_PIN_3, GPIO_INPUT},
			{GPIO_PORTN_BASE, GPIO_PIN_2, GPIO_INPUT},
			{GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_INPUT},
			{GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_INPUT},
			{GPIO_PORTP_BASE, GPIO_PIN_1, GPIO_INPUT},

			{GPIO_PORTE_BASE, GPIO_PIN_5, GPIO_INPUT},
			{GPIO_PORTD_BASE, GPIO_PIN_3, GPIO_OUTPUT},
			{GPIO_PORTS_BASE, GPIO_PIN_3, GPIO_OUTPUT},
			{GPIO_PORTL_BASE, GPIO_PIN_5, GPIO_OUTPUT},
			{GPIO_PORTS_BASE, GPIO_PIN_0, GPIO_INPUT},
			{GPIO_PORTN_BASE, GPIO_PIN_7, GPIO_INPUT},
			{GPIO_PORTF_BASE, GPIO_PIN_3, GPIO_INPUT},

			{GPIO_PORTQ_BASE, GPIO_PIN_3, GPIO_OUTPUT},
			{GPIO_PORTM_BASE, GPIO_PIN_7, GPIO_OUTPUT},

};

extern const GPIO_Config GPIO_config[] = {
    {&gpioHWAttrs[0]},
    {&gpioHWAttrs[1]},
    {&gpioHWAttrs[2]},
    {&gpioHWAttrs[3]},
    {&gpioHWAttrs[4]},

	{&gpioHWAttrs[5]},
	{&gpioHWAttrs[6]},
	{&gpioHWAttrs[7]},
	{&gpioHWAttrs[8]},
	{&gpioHWAttrs[9]},
	{&gpioHWAttrs[10]},
	{&gpioHWAttrs[11]},
	{&gpioHWAttrs[12]},

	{&gpioHWAttrs[13]},
	{&gpioHWAttrs[14]},
    {NULL}
};

/*
 *  ======== EK_TM4C1294XL_initGPIO ========
 */
void DK_TM4C129X_initGPIO(void)
{
	GPIOPinTypeGPIOOutput(GPIO_PORTL_BASE, GPIO_PIN_4);
	GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_3);
	GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_2);
	GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_1);
	GPIOPinTypeGPIOInput(GPIO_PORTN_BASE, GPIO_PIN_0);
	GPIOPinTypeGPIOInput(GPIO_PORTP_BASE, GPIO_PIN_1);
	GPIOPinTypeGPIOInput(GPIO_PORTE_BASE, GPIO_PIN_5);

	GPIOPinTypeGPIOOutput(GPIO_PORTD_BASE, GPIO_PIN_3);
	GPIOPinTypeGPIOOutput(GPIO_PORTS_BASE, GPIO_PIN_3);
	GPIOPinTypeGPIOOutput(GPIO_PORTL_BASE, GPIO_PIN_5);
	GPIOPinTypeGPIOInput (GPIO_PORTS_BASE, GPIO_PIN_0);
	GPIOPinTypeGPIOInput (GPIO_PORTN_BASE, GPIO_PIN_7);
	GPIOPinTypeGPIOInput (GPIO_PORTF_BASE, GPIO_PIN_3);

	GPIOPinTypeGPIOOutput(GPIO_PORTQ_BASE, GPIO_PIN_3);
	GPIOPinTypeGPIOOutput(GPIO_PORTM_BASE, GPIO_PIN_7);


    GPIOPadConfigSet(GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD_WPU);
    GPIOPadConfigSet(GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD_WPU);
    GPIOPadConfigSet(GPIO_PORTN_BASE, GPIO_PIN_2, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD_WPU);
    GPIOPadConfigSet(GPIO_PORTN_BASE, GPIO_PIN_3, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD_WPU);
    GPIOPadConfigSet(GPIO_PORTP_BASE, GPIO_PIN_1, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD_WPU);
    GPIOPadConfigSet(GPIO_PORTE_BASE, GPIO_PIN_5, GPIO_STRENGTH_12MA, GPIO_PIN_TYPE_STD_WPU);

    GPIOPadConfigSet(GPIO_PORTG_BASE, GPIO_PIN_0, GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD_WPU);
    GPIOPinTypeGPIOInput(GPIO_PORTL_BASE, GPIO_PIN_1);  //PL1 Fn1
    GPIOPadConfigSet(GPIO_PORTL_BASE, GPIO_PIN_1, GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD_WPU);
    GPIOPinTypeGPIOInput(GPIO_PORTK_BASE, GPIO_PIN_7);  //PK7 Fn2
    GPIOPadConfigSet(GPIO_PORTK_BASE, GPIO_PIN_7, GPIO_STRENGTH_4MA, GPIO_PIN_TYPE_STD_WPU);


/* Once GPIO_init is called, GPIO_config cannot be changed */
    GPIO_init();
}
#else

const GPIO_HWAttrs gpioHWAttrs[EK_TM4C1294XL_GPIOCOUNT] = {
	{GPIO_PORTL_BASE, GPIO_PIN_4, GPIO_OUTPUT},
	{GPIO_PORTN_BASE, GPIO_PIN_2, GPIO_OUTPUT},
	{GPIO_PORTN_BASE, GPIO_PIN_1, GPIO_OUTPUT},
	{GPIO_PORTN_BASE, GPIO_PIN_0, GPIO_OUTPUT},
	{GPIO_PORTQ_BASE, GPIO_PIN_7, GPIO_OUTPUT},

	{GPIO_PORTM_BASE, GPIO_PIN_5, GPIO_OUTPUT},
	{GPIO_PORTD_BASE, GPIO_PIN_3, GPIO_OUTPUT},
	{GPIO_PORTS_BASE, GPIO_PIN_3, GPIO_OUTPUT},
	{GPIO_PORTL_BASE, GPIO_PIN_5, GPIO_OUTPUT},
	{GPIO_PORTS_BASE, GPIO_PIN_0, GPIO_INPUT},
	{GPIO_PORTN_BASE, GPIO_PIN_7, GPIO_INPUT},
	{GPIO_PORTF_BASE, GPIO_PIN_3, GPIO_INPUT},
	{GPIO_PORTN_BASE, GPIO_PIN_5, GPIO_OUTPUT},

	{GPIO_PORTQ_BASE, GPIO_PIN_3, GPIO_OUTPUT},
	{GPIO_PORTM_BASE, GPIO_PIN_7, GPIO_OUTPUT},
	{GPIO_PORTJ_BASE, GPIO_PIN_7, GPIO_OUTPUT},
	{GPIO_PORTC_BASE, GPIO_PIN_6, GPIO_OUTPUT},
	{GPIO_PORTM_BASE, GPIO_PIN_6, GPIO_OUTPUT},
	{GPIO_PORTF_BASE, GPIO_PIN_3, GPIO_OUTPUT},
	{GPIO_PORTG_BASE, GPIO_PIN_7, GPIO_OUTPUT},

